Revit 2026 API

# SpotDimensionCanFlip Method

---

Verifies that the direction of the dimension can be flipped.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFlip()
```
```vb
Public Function CanFlip As Boolean
```
```cpp
public:
bool CanFlip()
```
```fsharp
member CanFlip : unit -> bool
```

#### Return Value

Boolean True if the element can be flipped, false otherwise.

Currently, flipping only allowed for non-pinned AlignmentStationLabels.

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace